package liiuf.dp.beh.strategy;

import liiuf.dp.beh.strategy.exp01.ConcreteStrategy;
import liiuf.dp.beh.strategy.exp01.Context;
import liiuf.dp.beh.strategy.exp01.Strategy;
import org.junit.Test;

/**
 * @简介
 * - 定义一组算法，将每个算法都封装起来，并且使它们之间可以互换。
 * - 策略模式是一种行为设计模式，它能让你定义一系列算法，并将每种算法分别放入独立的类中，以使算法的对象能够相互替换。
 * - 通过对象方式实现。
 *
 * @分类
 * - 上下文（Context）维护指向具体策略的引用，且仅通过策略接口与该对象进行交流。
 * - 策略（Strategy） 接口是所有具体策略的通用接口，它声明了一个上下文用于执行策略的方法。
 * - 具体策略（Concrete Strategies）实现了上下文所用算法的各种不同变体。
 * - 当上下文需要运行算法时，它会在其已连接的策略对象上调用执行方法。上下文不清楚其所涉及的策略类型与算法的执行方式。
 * - 客户端（Client） 会创建一个特定策略对象并将其传递给上下文。 上下文则会提供一个设置器以便客户端在运行时替换相关联的策略。
 *
 * @优缺点
 * #优点
 * - 你可以在运行时切换对象内的算法。
 * - 你可以将算法的实现和使用算法的代码隔离开来。
 * - 你可以使用组合来代替继承。
 * - 开闭原则。 你无需对上下文进行修改就能够引入新的策略。
 * #缺点
 * - 如果你的算法极少发生改变， 那么没有任何理由引入新的类和接口。 使用该模式只会让程序过于复杂。
 * - 客户端必须知晓策略间的不同——它需要选择合适的策略（对外暴露）。
 * - 许多现代编程语言支持函数类型功能，允许你在一组匿名函数中实现不同版本的算法。这样，你使用这些函数的方式就和使用策略对象时完全相同，
 *  无需借助额外的类和接口来保持代码简洁。
 * 注意：如果系统中的一个策略家族的具体策略数量超过4个，则需要考虑使用混合模式，解决策略类膨胀和对外暴露的问题，否则日后的系统维护就会很困难。
 *
 * @使用场景
 * - 当你想使用对象中各种不同的算法变体，并希望能在运行时切换算法时，可使用策略模式。策略模式让你能够将对象关联至可以不同方式执行特定子任务的不同
 *  子对象，从而以间接方式在运行时更改对象行为。
 * - 当你有许多仅在执行某些行为时略有不同的相似类时，可使用策略模式。策略模式让你能将不同行为抽取到一个独立类层次结构中，并将原始类组合成同一个，
 *  从而减少重复代码。
 * - 如果算法在上下文的逻辑中不是特别重要，使用该模式能将类的业务逻辑与其算法实现细节隔离开来。策略模式让你能将各种算法的代码、内部数据和依赖关系
 *  与其他代码隔离开来。不同客户端可通过一个简单接口执行算法，并能在运行时进行切换。
 * - 当类中使用了复杂条件运算符以在同一算法的不同变体中切换时，可使用该模式。策略模式将所有继承自同样接口的算法抽取到独立类中，
 *  因此不再需要条件语句。原始对象并不实现所有算法的变体，而是将执行工作委派给其中的一个独立算法对象。
 *
 * @思路
 * - 从上下文类中找出修改频率较高的算法（也可能是用于在运行时选择某个算法变体的复杂条件运算符）。
 * - 声明该算法所有变体的通用策略接口。
 * - 将算法逐一抽取到各自的类中，它们都必须实现策略接口。
 * - 在上下文类中添加一个成员变量用于保存对于策略对象的引用。然后提供设置器以修改该成员变量。上下文仅可通过策略接口同策略对象进行交互，
 *  如有需要还可定义一个接口来让策略访问其数据。
 * - 客户端必须将上下文类与相应策略进行关联，使上下文可以预期的方式完成其主要工作。
 */
public class StrategyClient {
    @Test
    public void testStrategy() {
        Strategy strategy = new ConcreteStrategy();
        Context context = new Context();
        context.setStrategy(strategy);
        strategy.execute();
    }
}